app/Controllers/contactoController.php

    public function consultas()
    {
        $consultas = $this->consultaModel->findAll();
---
SELECT *
FROM `Consulta`

    public function crearConsulta()
    {
        $data = [
            'nombre'            => $this->request->getPost('nombre'),
            'apellido'          => $this->request->getPost('apellido'),
            'asunto'            => $this->request->getPost('asunto'),
            'correoElectronico' => $this->request->getPost('email'),
            'descripcion'       => $this->request->getPost('descripcion'),
            'idEstado'          => 1
        ];

        $this->consultaModel->insert($data);
---
INSERT INTO `Consulta` (`nombre`, `apellido`, `asunto`, `correoElectronico`, `descripcion`, `idEstado`) VALUES ('Iara', 'Bongiovanni', 'Pagina', 'bongiovaniiara22@gmail.com', 'Como puedo realizar una compra?', 1)