app/Controllers/loginController.php

SELECT *
FROM `Usuario`
WHERE `correoElectronico` = 'bongiovaniiara22@gmail.com'
 LIMIT 1
---
public function iniciarSesion()
{
    $correo = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    if (!$correo || !$password) {
        session()->setFlashdata('error', 'Debes completar ambos campos.');
        return redirect()->to('iniciarSesion');
    }

    // Verificar que usuarioModel está instanciado correctamente
    if (!is_object($this->usuarioModel)) {
        error_log("Error: usuarioModel no está instanciado correctamente.");
        session()->setFlashdata('error', 'Error interno, intenta más tarde.');
        return redirect()->to('iniciarSesion');
    }

    // Buscar el usuario en la base de datos
    $usuario = $this->usuarioModel->where('correoElectronico', $correo)->first();