app/Controllers/panelController.php

SELECT COUNT(*) AS `numrows` FROM `Producto`
SELECT COUNT(*) AS `numrows` FROM `Usuario`
---
    public function panelAdmin()
    {

        $totalProductos = $this->productoModel->countAll();
        $totalUsuarios = $this->usuarioModel->countAll();

SELECT *
FROM `Usuario`
---
    public function cargarVista($vista)
    {
        if ($vista === 'usuarios') {
            $usuarioModel = new \App\Models\UsuarioModel();
            $data['usuarios'] = $usuarioModel->findAll();

SELECT *
FROM `Usuario`
WHERE `idUsuario` != '2'
AND `idEstadoUsuario` = 1
---
    public function listadoUsuarios()
    {
        $session = session();
        $idUsuarioActual = $session->get('idUsuario');

        $usuarioModel = new UsuarioModel();

        // Obtener todos los usuarios activos excepto el de la sesión actual
        $data['usuarios'] = $usuarioModel->where('idUsuario !=', $idUsuarioActual)
                                        ->where('idEstadoUsuario', 1)
                                        ->findAll();