app/Controllers/productosController.php

SELECT *
FROM `Categoria`
---
    public function obtenerCategorias()
    {
        return $this->categoriaModel->findAll();