app/Controllers/VentasDetalleController.php

public function ventaDetalle()
{
    if (!session()->has('idUsuario')) {
        return view('modales/error_sesion');
    }

    $usuarioModel = new \App\Models\UsuarioModel();
    $productoModel = new \App\Models\ProductoModel();
    $metodoPagoModel = new \App\Models\MetodoPagoModel();

    $carrito = session('carrito') ?? [];

    $usuario = $usuarioModel->find(session('idUsuario'));

    $detalle = [];
    foreach ($carrito as $item) {
        $producto = $productoModel->find($item['idProducto']);
        $detalle[] = [
            'descripcion' => $producto['descripcion'],
            'cantidad' => $item['cantidad'],
            'precio' => $producto['precioUnit']
        ];
    }

    $metodos = $metodoPagoModel->where('idEstado', 1)->findAll();
---
SELECT *
FROM `Usuario`
WHERE `Usuario`.`idUsuario` = '2'
SELECT *
FROM `Producto`
WHERE `Producto`.`idProducto` = '3'
SELECT *
FROM `MetodoPago`
WHERE `idEstado` = 1